esp8266/Arduino/boards.txt
##############################################################
espmxdevkit.name=DOIT ESP-Mx DevKit (ESP8285)
espmxdevkit.build.board=ESP8266_ESP01
espmxdevkit.build.led=-DLED_BUILTIN=16
espmxdevkit.build.variant=esp8285
espmxdevkit.upload.tool=esptool
espmxdevkit.upload.maximum_data_size=81920
espmxdevkit.upload.wait_for_upload_port=true
espmxdevkit.upload.erase_cmd=
espmxdevkit.serial.disableDTR=true
espmxdevkit.serial.disableRTS=true
espmxdevkit.build.mcu=esp8266
espmxdevkit.build.core=esp8266
espmxdevkit.build.spiffs_pagesize=256
espmxdevkit.build.debug_port=
espmxdevkit.build.debug_level=
espmxdevkit.menu.xtal.80=80 MHz
espmxdevkit.menu.xtal.80.build.f_cpu=80000000L
espmxdevkit.menu.xtal.160=160 MHz
espmxdevkit.menu.xtal.160.build.f_cpu=160000000L
espmxdevkit.menu.vt.flash=Flash
espmxdevkit.menu.vt.flash.build.vtable_flags=-DVTABLES_IN_FLASH
espmxdevkit.menu.vt.heap=Heap
espmxdevkit.menu.vt.heap.build.vtable_flags=-DVTABLES_IN_DRAM
espmxdevkit.menu.vt.iram=IRAM
espmxdevkit.menu.vt.iram.build.vtable_flags=-DVTABLES_IN_IRAM
espmxdevkit.menu.exception.disabled=Disabled (new aborts on oom)
espmxdevkit.menu.exception.disabled.build.exception_flags=-fno-exceptions
espmxdevkit.menu.exception.disabled.build.stdcpp_lib=-lstdc++
espmxdevkit.menu.exception.enabled=Enabled
espmxdevkit.menu.exception.enabled.build.exception_flags=-fexceptions
espmxdevkit.menu.exception.enabled.build.stdcpp_lib=-lstdc++-exc
espmxdevkit.menu.stacksmash.disabled=Disabled
espmxdevkit.menu.stacksmash.disabled.build.stacksmash_flags=
espmxdevkit.menu.stacksmash.enabled=Enabled
espmxdevkit.menu.stacksmash.enabled.build.stacksmash_flags=-fstack-protector
espmxdevkit.menu.ssl.all=All SSL ciphers (most compatible)
espmxdevkit.menu.ssl.all.build.sslflags=
espmxdevkit.menu.ssl.basic=Basic SSL ciphers (lower ROM use)
espmxdevkit.menu.ssl.basic.build.sslflags=-DBEARSSL_SSL_BASIC
espmxdevkit.menu.mmu.3232=32KB cache + 32KB IRAM (balanced)
espmxdevkit.menu.mmu.3232.build.mmuflags=-DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x8000
espmxdevkit.menu.mmu.4816=16KB cache + 48KB IRAM (IRAM)
espmxdevkit.menu.mmu.4816.build.mmuflags=-DMMU_IRAM_SIZE=0xC000 -DMMU_ICACHE_SIZE=0x4000
espmxdevkit.menu.mmu.4816H=16KB cache + 48KB IRAM and 2nd Heap (shared)
espmxdevkit.menu.mmu.4816H.build.mmuflags=-DMMU_IRAM_SIZE=0xC000 -DMMU_ICACHE_SIZE=0x4000 -DMMU_IRAM_HEAP
espmxdevkit.menu.mmu.3216=16KB cache + 32KB IRAM + 16KB 2nd Heap (not shared)
espmxdevkit.menu.mmu.3216.build.mmuflags=-DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x4000 -DMMU_SEC_HEAP=0x40108000 -DMMU_SEC_HEAP_SIZE=0x4000
espmxdevkit.menu.mmu.ext128k=128K External 23LC1024
espmxdevkit.menu.mmu.ext128k.build.mmuflags=-DMMU_EXTERNAL_HEAP=128 -DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x8000
espmxdevkit.menu.mmu.ext1024k=1M External 64 MBit PSRAM
espmxdevkit.menu.mmu.ext1024k.build.mmuflags=-DMMU_EXTERNAL_HEAP=256 -DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x8000
espmxdevkit.menu.non32xfer.fast=Use pgm_read macros for IRAM/PROGMEM
espmxdevkit.menu.non32xfer.fast.build.non32xferflags=
espmxdevkit.menu.non32xfer.safe=Byte/Word access to IRAM/PROGMEM (very slow)
espmxdevkit.menu.non32xfer.safe.build.non32xferflags=-DNON32XFER_HANDLER
espmxdevkit.upload.resetmethod=--before default_reset --after hard_reset
espmxdevkit.build.flash_mode=dout
espmxdevkit.build.flash_flags=-DFLASHMODE_DOUT
espmxdevkit.build.flash_freq=40
espmxdevkit.menu.eesz.1M64=1MB (FS:64KB OTA:~470KB)
espmxdevkit.menu.eesz.1M64.build.flash_size=1M
espmxdevkit.menu.eesz.1M64.build.flash_ld=eagle.flash.1m64.ld
espmxdevkit.menu.eesz.1M64.build.spiffs_pagesize=256
espmxdevkit.menu.eesz.1M64.build.rfcal_addr=0xFC000
espmxdevkit.menu.eesz.1M64.build.spiffs_start=0xEB000
espmxdevkit.menu.eesz.1M64.build.spiffs_end=0xFB000
espmxdevkit.menu.eesz.1M64.build.spiffs_blocksize=4096
espmxdevkit.menu.eesz.1M128=1MB (FS:128KB OTA:~438KB)
espmxdevkit.menu.eesz.1M128.build.flash_size=1M
espmxdevkit.menu.eesz.1M128.build.flash_ld=eagle.flash.1m128.ld
espmxdevkit.menu.eesz.1M128.build.spiffs_pagesize=256
espmxdevkit.menu.eesz.1M128.build.rfcal_addr=0xFC000
espmxdevkit.menu.eesz.1M128.build.spiffs_start=0xDB000
espmxdevkit.menu.eesz.1M128.build.spiffs_end=0xFB000
espmxdevkit.menu.eesz.1M128.build.spiffs_blocksize=4096
espmxdevkit.menu.eesz.1M144=1MB (FS:144KB OTA:~430KB)
espmxdevkit.menu.eesz.1M144.build.flash_size=1M
espmxdevkit.menu.eesz.1M144.build.flash_ld=eagle.flash.1m144.ld
espmxdevkit.menu.eesz.1M144.build.spiffs_pagesize=256
espmxdevkit.menu.eesz.1M144.build.rfcal_addr=0xFC000
espmxdevkit.menu.eesz.1M144.build.spiffs_start=0xD7000
espmxdevkit.menu.eesz.1M144.build.spiffs_end=0xFB000
espmxdevkit.menu.eesz.1M144.build.spiffs_blocksize=4096
espmxdevkit.menu.eesz.1M160=1MB (FS:160KB OTA:~422KB)
espmxdevkit.menu.eesz.1M160.build.flash_size=1M
espmxdevkit.menu.eesz.1M160.build.flash_ld=eagle.flash.1m160.ld
espmxdevkit.menu.eesz.1M160.build.spiffs_pagesize=256
espmxdevkit.menu.eesz.1M160.build.rfcal_addr=0xFC000
espmxdevkit.menu.eesz.1M160.build.spiffs_start=0xD3000
espmxdevkit.menu.eesz.1M160.build.spiffs_end=0xFB000
espmxdevkit.menu.eesz.1M160.build.spiffs_blocksize=4096
espmxdevkit.menu.eesz.1M192=1MB (FS:192KB OTA:~406KB)
espmxdevkit.menu.eesz.1M192.build.flash_size=1M
espmxdevkit.menu.eesz.1M192.build.flash_ld=eagle.flash.1m192.ld
espmxdevkit.menu.eesz.1M192.build.spiffs_pagesize=256
espmxdevkit.menu.eesz.1M192.build.rfcal_addr=0xFC000
espmxdevkit.menu.eesz.1M192.build.spiffs_start=0xCB000
espmxdevkit.menu.eesz.1M192.build.spiffs_end=0xFB000
espmxdevkit.menu.eesz.1M192.build.spiffs_blocksize=4096
espmxdevkit.menu.eesz.1M256=1MB (FS:256KB OTA:~374KB)
espmxdevkit.menu.eesz.1M256.build.flash_size=1M
espmxdevkit.menu.eesz.1M256.build.flash_ld=eagle.flash.1m256.ld
espmxdevkit.menu.eesz.1M256.build.spiffs_pagesize=256
espmxdevkit.menu.eesz.1M256.build.rfcal_addr=0xFC000
espmxdevkit.menu.eesz.1M256.build.spiffs_start=0xBB000
espmxdevkit.menu.eesz.1M256.build.spiffs_end=0xFB000
espmxdevkit.menu.eesz.1M256.build.spiffs_blocksize=4096
espmxdevkit.menu.eesz.1M512=1MB (FS:512KB OTA:~246KB)
espmxdevkit.menu.eesz.1M512.build.flash_size=1M
espmxdevkit.menu.eesz.1M512.build.flash_ld=eagle.flash.1m512.ld
espmxdevkit.menu.eesz.1M512.build.spiffs_pagesize=256
espmxdevkit.menu.eesz.1M512.build.rfcal_addr=0xFC000
espmxdevkit.menu.eesz.1M512.build.spiffs_start=0x7B000
espmxdevkit.menu.eesz.1M512.build.spiffs_end=0xFB000
espmxdevkit.menu.eesz.1M512.build.spiffs_blocksize=8192
espmxdevkit.menu.eesz.1M=1MB (FS:none OTA:~502KB)
espmxdevkit.menu.eesz.1M.build.flash_size=1M
espmxdevkit.menu.eesz.1M.build.flash_ld=eagle.flash.1m.ld
espmxdevkit.menu.eesz.1M.build.spiffs_pagesize=256
espmxdevkit.menu.eesz.1M.build.rfcal_addr=0xFC000
espmxdevkit.menu.ip.lm2f=v2 Lower Memory
espmxdevkit.menu.ip.lm2f.build.lwip_include=lwip2/include
espmxdevkit.menu.ip.lm2f.build.lwip_lib=-llwip2-536-feat
espmxdevkit.menu.ip.lm2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
espmxdevkit.menu.ip.hb2f=v2 Higher Bandwidth
espmxdevkit.menu.ip.hb2f.build.lwip_include=lwip2/include
espmxdevkit.menu.ip.hb2f.build.lwip_lib=-llwip2-1460-feat
espmxdevkit.menu.ip.hb2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
espmxdevkit.menu.ip.lm2n=v2 Lower Memory (no features)
espmxdevkit.menu.ip.lm2n.build.lwip_include=lwip2/include
espmxdevkit.menu.ip.lm2n.build.lwip_lib=-llwip2-536
espmxdevkit.menu.ip.lm2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
espmxdevkit.menu.ip.hb2n=v2 Higher Bandwidth (no features)
espmxdevkit.menu.ip.hb2n.build.lwip_include=lwip2/include
espmxdevkit.menu.ip.hb2n.build.lwip_lib=-llwip2-1460
espmxdevkit.menu.ip.hb2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
espmxdevkit.menu.ip.lm6f=v2 IPv6 Lower Memory
espmxdevkit.menu.ip.lm6f.build.lwip_include=lwip2/include
espmxdevkit.menu.ip.lm6f.build.lwip_lib=-llwip6-536-feat
espmxdevkit.menu.ip.lm6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
espmxdevkit.menu.ip.hb6f=v2 IPv6 Higher Bandwidth
espmxdevkit.menu.ip.hb6f.build.lwip_include=lwip2/include
espmxdevkit.menu.ip.hb6f.build.lwip_lib=-llwip6-1460-feat
espmxdevkit.menu.ip.hb6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
espmxdevkit.menu.dbg.Disabled=Disabled
espmxdevkit.menu.dbg.Disabled.build.debug_port=
espmxdevkit.menu.dbg.Serial=Serial
espmxdevkit.menu.dbg.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
espmxdevkit.menu.dbg.Serial1=Serial1
espmxdevkit.menu.dbg.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
espmxdevkit.menu.lvl.None____=None
espmxdevkit.menu.lvl.None____.build.debug_level=
espmxdevkit.menu.lvl.SSL=SSL
espmxdevkit.menu.lvl.SSL.build.debug_level= -DDEBUG_ESP_SSL
espmxdevkit.menu.lvl.TLS_MEM=TLS_MEM
espmxdevkit.menu.lvl.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
espmxdevkit.menu.lvl.HTTP_CLIENT=HTTP_CLIENT
espmxdevkit.menu.lvl.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
espmxdevkit.menu.lvl.HTTP_SERVER=HTTP_SERVER
espmxdevkit.menu.lvl.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
espmxdevkit.menu.lvl.SSLTLS_MEM=SSL+TLS_MEM
espmxdevkit.menu.lvl.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
espmxdevkit.menu.lvl.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
espmxdevkit.menu.lvl.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
espmxdevkit.menu.lvl.SSLHTTP_SERVER=SSL+HTTP_SERVER
espmxdevkit.menu.lvl.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
espmxdevkit.menu.lvl.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
espmxdevkit.menu.lvl.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
espmxdevkit.menu.lvl.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
espmxdevkit.menu.lvl.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
espmxdevkit.menu.lvl.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
espmxdevkit.menu.lvl.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
espmxdevkit.menu.lvl.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
espmxdevkit.menu.lvl.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
espmxdevkit.menu.lvl.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
espmxdevkit.menu.lvl.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
espmxdevkit.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
espmxdevkit.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
espmxdevkit.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
espmxdevkit.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
espmxdevkit.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
espmxdevkit.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
espmxdevkit.menu.lvl.CORE=CORE
espmxdevkit.menu.lvl.CORE.build.debug_level= -DDEBUG_ESP_CORE
espmxdevkit.menu.lvl.WIFI=WIFI
espmxdevkit.menu.lvl.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
espmxdevkit.menu.lvl.HTTP_UPDATE=HTTP_UPDATE
espmxdevkit.menu.lvl.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
espmxdevkit.menu.lvl.UPDATER=UPDATER
espmxdevkit.menu.lvl.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
espmxdevkit.menu.lvl.OTA=OTA
espmxdevkit.menu.lvl.OTA.build.debug_level= -DDEBUG_ESP_OTA
espmxdevkit.menu.lvl.OOM=OOM
espmxdevkit.menu.lvl.OOM.build.debug_level= -DDEBUG_ESP_OOM
espmxdevkit.menu.lvl.MDNS=MDNS
espmxdevkit.menu.lvl.MDNS.build.debug_level= -DDEBUG_ESP_MDNS
espmxdevkit.menu.lvl.HWDT=HWDT
espmxdevkit.menu.lvl.HWDT.build.debug_level= -DDEBUG_ESP_HWDT
espmxdevkit.menu.lvl.HWDT_NOEXTRA4K=HWDT_NOEXTRA4K
espmxdevkit.menu.lvl.HWDT_NOEXTRA4K.build.debug_level= -DDEBUG_ESP_HWDT_NOEXTRA4K
espmxdevkit.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS
espmxdevkit.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS
espmxdevkit.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT
espmxdevkit.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT
espmxdevkit.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT_NOEXTRA4K
espmxdevkit.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT_NOEXTRA4K
espmxdevkit.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS
espmxdevkit.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS
espmxdevkit.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT
espmxdevkit.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT
espmxdevkit.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT_NOEXTRA4K
espmxdevkit.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT_NOEXTRA4K
espmxdevkit.menu.lvl.NoAssert-NDEBUG=NoAssert-NDEBUG
espmxdevkit.menu.lvl.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
espmxdevkit.menu.wipe.none=Only Sketch
espmxdevkit.menu.wipe.none.upload.erase_cmd=
espmxdevkit.menu.wipe.sdk=Sketch + WiFi Settings
espmxdevkit.menu.wipe.sdk.upload.erase_cmd=erase_region "{build.rfcal_addr}" 0x4000
espmxdevkit.menu.wipe.all=All Flash Contents
espmxdevkit.menu.wipe.all.upload.erase_cmd=erase_flash
espmxdevkit.menu.baud.115200=115200
espmxdevkit.menu.baud.115200.upload.speed=115200
espmxdevkit.menu.baud.57600=57600
espmxdevkit.menu.baud.57600.upload.speed=57600
espmxdevkit.menu.baud.230400.linux=230400
espmxdevkit.menu.baud.230400.macosx=230400
espmxdevkit.menu.baud.230400.upload.speed=230400
espmxdevkit.menu.baud.256000.windows=256000
espmxdevkit.menu.baud.256000.upload.speed=256000
espmxdevkit.menu.baud.460800.linux=460800
espmxdevkit.menu.baud.460800.macosx=460800
espmxdevkit.menu.baud.460800.upload.speed=460800
espmxdevkit.menu.baud.512000.windows=512000
espmxdevkit.menu.baud.512000.upload.speed=512000
espmxdevkit.menu.baud.921600=921600
espmxdevkit.menu.baud.921600.upload.speed=921600
espmxdevkit.menu.baud.3000000=3000000
espmxdevkit.menu.baud.3000000.upload.speed=3000000
espmxdevkit.menu.eesz.autoflash=Mapping defined by Hardware and Sketch
espmxdevkit.menu.eesz.autoflash.build.flash_size=16M
espmxdevkit.menu.eesz.autoflash.build.flash_ld=eagle.flash.auto.ld
espmxdevkit.menu.eesz.autoflash.build.extra_flags=-DAUTOFLASHSIZE=1
espmxdevkit.menu.eesz.autoflash.upload.maximum_size=1044464

