esp8266/Arduino/boards.txt
##############################################################
espduino.name=ESPDuino (ESP-13 Module)
espduino.build.board=ESP8266_ESP13
espduino.build.variant=ESPDuino
espduino.menu.ResetMethod.v1=ESPduino-V1
espduino.menu.ResetMethod.v1.upload.resetmethod=--before no_reset --after soft_reset
espduino.menu.ResetMethod.v2=ESPduino-V2
espduino.menu.ResetMethod.v2.upload.resetmethod=--before default_reset --after hard_reset
espduino.menu.UploadTool.espota=OTA
espduino.menu.UploadTool.espota.upload.tool=espota
espduino.menu.UploadTool.esptool=Serial
espduino.menu.UploadTool.esptool.upload.tool=esptool
espduino.menu.UploadTool.esptool.upload.verbose=--trace
espduino.upload.tool=esptool
espduino.upload.maximum_data_size=81920
espduino.upload.wait_for_upload_port=true
espduino.upload.erase_cmd=
espduino.serial.disableDTR=true
espduino.serial.disableRTS=true
espduino.build.mcu=esp8266
espduino.build.core=esp8266
espduino.build.spiffs_pagesize=256
espduino.build.debug_port=
espduino.build.debug_level=
espduino.menu.xtal.80=80 MHz
espduino.menu.xtal.80.build.f_cpu=80000000L
espduino.menu.xtal.160=160 MHz
espduino.menu.xtal.160.build.f_cpu=160000000L
espduino.menu.vt.flash=Flash
espduino.menu.vt.flash.build.vtable_flags=-DVTABLES_IN_FLASH
espduino.menu.vt.heap=Heap
espduino.menu.vt.heap.build.vtable_flags=-DVTABLES_IN_DRAM
espduino.menu.vt.iram=IRAM
espduino.menu.vt.iram.build.vtable_flags=-DVTABLES_IN_IRAM
espduino.menu.exception.disabled=Disabled (new aborts on oom)
espduino.menu.exception.disabled.build.exception_flags=-fno-exceptions
espduino.menu.exception.disabled.build.stdcpp_lib=-lstdc++
espduino.menu.exception.enabled=Enabled
espduino.menu.exception.enabled.build.exception_flags=-fexceptions
espduino.menu.exception.enabled.build.stdcpp_lib=-lstdc++-exc
espduino.menu.stacksmash.disabled=Disabled
espduino.menu.stacksmash.disabled.build.stacksmash_flags=
espduino.menu.stacksmash.enabled=Enabled
espduino.menu.stacksmash.enabled.build.stacksmash_flags=-fstack-protector
espduino.menu.ssl.all=All SSL ciphers (most compatible)
espduino.menu.ssl.all.build.sslflags=
espduino.menu.ssl.basic=Basic SSL ciphers (lower ROM use)
espduino.menu.ssl.basic.build.sslflags=-DBEARSSL_SSL_BASIC
espduino.menu.mmu.3232=32KB cache + 32KB IRAM (balanced)
espduino.menu.mmu.3232.build.mmuflags=-DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x8000
espduino.menu.mmu.4816=16KB cache + 48KB IRAM (IRAM)
espduino.menu.mmu.4816.build.mmuflags=-DMMU_IRAM_SIZE=0xC000 -DMMU_ICACHE_SIZE=0x4000
espduino.menu.mmu.4816H=16KB cache + 48KB IRAM and 2nd Heap (shared)
espduino.menu.mmu.4816H.build.mmuflags=-DMMU_IRAM_SIZE=0xC000 -DMMU_ICACHE_SIZE=0x4000 -DMMU_IRAM_HEAP
espduino.menu.mmu.3216=16KB cache + 32KB IRAM + 16KB 2nd Heap (not shared)
espduino.menu.mmu.3216.build.mmuflags=-DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x4000 -DMMU_SEC_HEAP=0x40108000 -DMMU_SEC_HEAP_SIZE=0x4000
espduino.menu.mmu.ext128k=128K External 23LC1024
espduino.menu.mmu.ext128k.build.mmuflags=-DMMU_EXTERNAL_HEAP=128 -DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x8000
espduino.menu.mmu.ext1024k=1M External 64 MBit PSRAM
espduino.menu.mmu.ext1024k.build.mmuflags=-DMMU_EXTERNAL_HEAP=256 -DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x8000
espduino.menu.non32xfer.fast=Use pgm_read macros for IRAM/PROGMEM
espduino.menu.non32xfer.fast.build.non32xferflags=
espduino.menu.non32xfer.safe=Byte/Word access to IRAM/PROGMEM (very slow)
espduino.menu.non32xfer.safe.build.non32xferflags=-DNON32XFER_HANDLER
espduino.build.flash_mode=dio
espduino.build.flash_flags=-DFLASHMODE_DIO
espduino.build.flash_freq=40
espduino.menu.eesz.4M2M=4MB (FS:2MB OTA:~1019KB)
espduino.menu.eesz.4M2M.build.flash_size=4M
espduino.menu.eesz.4M2M.build.flash_ld=eagle.flash.4m2m.ld
espduino.menu.eesz.4M2M.build.spiffs_pagesize=256
espduino.menu.eesz.4M2M.build.rfcal_addr=0x3FC000
espduino.menu.eesz.4M2M.build.spiffs_start=0x200000
espduino.menu.eesz.4M2M.build.spiffs_end=0x3FA000
espduino.menu.eesz.4M2M.build.spiffs_blocksize=8192
espduino.menu.eesz.4M3M=4MB (FS:3MB OTA:~512KB)
espduino.menu.eesz.4M3M.build.flash_size=4M
espduino.menu.eesz.4M3M.build.flash_ld=eagle.flash.4m3m.ld
espduino.menu.eesz.4M3M.build.spiffs_pagesize=256
espduino.menu.eesz.4M3M.build.rfcal_addr=0x3FC000
espduino.menu.eesz.4M3M.build.spiffs_start=0x100000
espduino.menu.eesz.4M3M.build.spiffs_end=0x3FA000
espduino.menu.eesz.4M3M.build.spiffs_blocksize=8192
espduino.menu.eesz.4M1M=4MB (FS:1MB OTA:~1019KB)
espduino.menu.eesz.4M1M.build.flash_size=4M
espduino.menu.eesz.4M1M.build.flash_ld=eagle.flash.4m1m.ld
espduino.menu.eesz.4M1M.build.spiffs_pagesize=256
espduino.menu.eesz.4M1M.build.rfcal_addr=0x3FC000
espduino.menu.eesz.4M1M.build.spiffs_start=0x300000
espduino.menu.eesz.4M1M.build.spiffs_end=0x3FA000
espduino.menu.eesz.4M1M.build.spiffs_blocksize=8192
espduino.menu.eesz.4M=4MB (FS:none OTA:~1019KB)
espduino.menu.eesz.4M.build.flash_size=4M
espduino.menu.eesz.4M.build.flash_ld=eagle.flash.4m.ld
espduino.menu.eesz.4M.build.spiffs_pagesize=256
espduino.menu.eesz.4M.build.rfcal_addr=0x3FC000
espduino.menu.ip.lm2f=v2 Lower Memory
espduino.menu.ip.lm2f.build.lwip_include=lwip2/include
espduino.menu.ip.lm2f.build.lwip_lib=-llwip2-536-feat
espduino.menu.ip.lm2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
espduino.menu.ip.hb2f=v2 Higher Bandwidth
espduino.menu.ip.hb2f.build.lwip_include=lwip2/include
espduino.menu.ip.hb2f.build.lwip_lib=-llwip2-1460-feat
espduino.menu.ip.hb2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
espduino.menu.ip.lm2n=v2 Lower Memory (no features)
espduino.menu.ip.lm2n.build.lwip_include=lwip2/include
espduino.menu.ip.lm2n.build.lwip_lib=-llwip2-536
espduino.menu.ip.lm2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
espduino.menu.ip.hb2n=v2 Higher Bandwidth (no features)
espduino.menu.ip.hb2n.build.lwip_include=lwip2/include
espduino.menu.ip.hb2n.build.lwip_lib=-llwip2-1460
espduino.menu.ip.hb2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
espduino.menu.ip.lm6f=v2 IPv6 Lower Memory
espduino.menu.ip.lm6f.build.lwip_include=lwip2/include
espduino.menu.ip.lm6f.build.lwip_lib=-llwip6-536-feat
espduino.menu.ip.lm6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
espduino.menu.ip.hb6f=v2 IPv6 Higher Bandwidth
espduino.menu.ip.hb6f.build.lwip_include=lwip2/include
espduino.menu.ip.hb6f.build.lwip_lib=-llwip6-1460-feat
espduino.menu.ip.hb6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
espduino.menu.dbg.Disabled=Disabled
espduino.menu.dbg.Disabled.build.debug_port=
espduino.menu.dbg.Serial=Serial
espduino.menu.dbg.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
espduino.menu.dbg.Serial1=Serial1
espduino.menu.dbg.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
espduino.menu.lvl.None____=None
espduino.menu.lvl.None____.build.debug_level=
espduino.menu.lvl.SSL=SSL
espduino.menu.lvl.SSL.build.debug_level= -DDEBUG_ESP_SSL
espduino.menu.lvl.TLS_MEM=TLS_MEM
espduino.menu.lvl.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
espduino.menu.lvl.HTTP_CLIENT=HTTP_CLIENT
espduino.menu.lvl.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
espduino.menu.lvl.HTTP_SERVER=HTTP_SERVER
espduino.menu.lvl.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
espduino.menu.lvl.SSLTLS_MEM=SSL+TLS_MEM
espduino.menu.lvl.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
espduino.menu.lvl.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
espduino.menu.lvl.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
espduino.menu.lvl.SSLHTTP_SERVER=SSL+HTTP_SERVER
espduino.menu.lvl.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
espduino.menu.lvl.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
espduino.menu.lvl.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
espduino.menu.lvl.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
espduino.menu.lvl.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
espduino.menu.lvl.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
espduino.menu.lvl.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
espduino.menu.lvl.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
espduino.menu.lvl.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
espduino.menu.lvl.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
espduino.menu.lvl.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
espduino.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
espduino.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
espduino.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
espduino.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
espduino.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
espduino.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
espduino.menu.lvl.CORE=CORE
espduino.menu.lvl.CORE.build.debug_level= -DDEBUG_ESP_CORE
espduino.menu.lvl.WIFI=WIFI
espduino.menu.lvl.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
espduino.menu.lvl.HTTP_UPDATE=HTTP_UPDATE
espduino.menu.lvl.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
espduino.menu.lvl.UPDATER=UPDATER
espduino.menu.lvl.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
espduino.menu.lvl.OTA=OTA
espduino.menu.lvl.OTA.build.debug_level= -DDEBUG_ESP_OTA
espduino.menu.lvl.OOM=OOM
espduino.menu.lvl.OOM.build.debug_level= -DDEBUG_ESP_OOM
espduino.menu.lvl.MDNS=MDNS
espduino.menu.lvl.MDNS.build.debug_level= -DDEBUG_ESP_MDNS
espduino.menu.lvl.HWDT=HWDT
espduino.menu.lvl.HWDT.build.debug_level= -DDEBUG_ESP_HWDT
espduino.menu.lvl.HWDT_NOEXTRA4K=HWDT_NOEXTRA4K
espduino.menu.lvl.HWDT_NOEXTRA4K.build.debug_level= -DDEBUG_ESP_HWDT_NOEXTRA4K
espduino.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS
espduino.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS
espduino.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT
espduino.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT
espduino.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT_NOEXTRA4K
espduino.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT_NOEXTRA4K
espduino.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS
espduino.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS
espduino.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT
espduino.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT
espduino.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT_NOEXTRA4K
espduino.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT_NOEXTRA4K
espduino.menu.lvl.NoAssert-NDEBUG=NoAssert-NDEBUG
espduino.menu.lvl.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
espduino.menu.wipe.none=Only Sketch
espduino.menu.wipe.none.upload.erase_cmd=
espduino.menu.wipe.sdk=Sketch + WiFi Settings
espduino.menu.wipe.sdk.upload.erase_cmd=erase_region "{build.rfcal_addr}" 0x4000
espduino.menu.wipe.all=All Flash Contents
espduino.menu.wipe.all.upload.erase_cmd=erase_flash
espduino.menu.baud.115200=115200
espduino.menu.baud.115200.upload.speed=115200
espduino.menu.baud.57600=57600
espduino.menu.baud.57600.upload.speed=57600
espduino.menu.baud.230400.linux=230400
espduino.menu.baud.230400.macosx=230400
espduino.menu.baud.230400.upload.speed=230400
espduino.menu.baud.256000.windows=256000
espduino.menu.baud.256000.upload.speed=256000
espduino.menu.baud.460800.linux=460800
espduino.menu.baud.460800.macosx=460800
espduino.menu.baud.460800.upload.speed=460800
espduino.menu.baud.512000.windows=512000
espduino.menu.baud.512000.upload.speed=512000
espduino.menu.baud.921600=921600
espduino.menu.baud.921600.upload.speed=921600
espduino.menu.baud.3000000=3000000
espduino.menu.baud.3000000.upload.speed=3000000
espduino.menu.eesz.autoflash=Mapping defined by Hardware and Sketch
espduino.menu.eesz.autoflash.build.flash_size=16M
espduino.menu.eesz.autoflash.build.flash_ld=eagle.flash.auto.ld
espduino.menu.eesz.autoflash.build.extra_flags=-DAUTOFLASHSIZE=1
espduino.menu.eesz.autoflash.upload.maximum_size=1044464

