esp8266/Arduino/boards.txt
##############################################################
espresso_lite_v2.name=ESPresso Lite 2.0
espresso_lite_v2.build.board=ESP8266_ESPRESSO_LITE_V2
espresso_lite_v2.build.variant=espresso_lite_v2
espresso_lite_v2.upload.tool=esptool
espresso_lite_v2.upload.maximum_data_size=81920
espresso_lite_v2.upload.wait_for_upload_port=true
espresso_lite_v2.upload.erase_cmd=
espresso_lite_v2.serial.disableDTR=true
espresso_lite_v2.serial.disableRTS=true
espresso_lite_v2.build.mcu=esp8266
espresso_lite_v2.build.core=esp8266
espresso_lite_v2.build.spiffs_pagesize=256
espresso_lite_v2.build.debug_port=
espresso_lite_v2.build.debug_level=
espresso_lite_v2.menu.xtal.80=80 MHz
espresso_lite_v2.menu.xtal.80.build.f_cpu=80000000L
espresso_lite_v2.menu.xtal.160=160 MHz
espresso_lite_v2.menu.xtal.160.build.f_cpu=160000000L
espresso_lite_v2.menu.vt.flash=Flash
espresso_lite_v2.menu.vt.flash.build.vtable_flags=-DVTABLES_IN_FLASH
espresso_lite_v2.menu.vt.heap=Heap
espresso_lite_v2.menu.vt.heap.build.vtable_flags=-DVTABLES_IN_DRAM
espresso_lite_v2.menu.vt.iram=IRAM
espresso_lite_v2.menu.vt.iram.build.vtable_flags=-DVTABLES_IN_IRAM
espresso_lite_v2.menu.exception.disabled=Disabled (new aborts on oom)
espresso_lite_v2.menu.exception.disabled.build.exception_flags=-fno-exceptions
espresso_lite_v2.menu.exception.disabled.build.stdcpp_lib=-lstdc++
espresso_lite_v2.menu.exception.enabled=Enabled
espresso_lite_v2.menu.exception.enabled.build.exception_flags=-fexceptions
espresso_lite_v2.menu.exception.enabled.build.stdcpp_lib=-lstdc++-exc
espresso_lite_v2.menu.stacksmash.disabled=Disabled
espresso_lite_v2.menu.stacksmash.disabled.build.stacksmash_flags=
espresso_lite_v2.menu.stacksmash.enabled=Enabled
espresso_lite_v2.menu.stacksmash.enabled.build.stacksmash_flags=-fstack-protector
espresso_lite_v2.menu.ssl.all=All SSL ciphers (most compatible)
espresso_lite_v2.menu.ssl.all.build.sslflags=
espresso_lite_v2.menu.ssl.basic=Basic SSL ciphers (lower ROM use)
espresso_lite_v2.menu.ssl.basic.build.sslflags=-DBEARSSL_SSL_BASIC
espresso_lite_v2.menu.mmu.3232=32KB cache + 32KB IRAM (balanced)
espresso_lite_v2.menu.mmu.3232.build.mmuflags=-DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x8000
espresso_lite_v2.menu.mmu.4816=16KB cache + 48KB IRAM (IRAM)
espresso_lite_v2.menu.mmu.4816.build.mmuflags=-DMMU_IRAM_SIZE=0xC000 -DMMU_ICACHE_SIZE=0x4000
espresso_lite_v2.menu.mmu.4816H=16KB cache + 48KB IRAM and 2nd Heap (shared)
espresso_lite_v2.menu.mmu.4816H.build.mmuflags=-DMMU_IRAM_SIZE=0xC000 -DMMU_ICACHE_SIZE=0x4000 -DMMU_IRAM_HEAP
espresso_lite_v2.menu.mmu.3216=16KB cache + 32KB IRAM + 16KB 2nd Heap (not shared)
espresso_lite_v2.menu.mmu.3216.build.mmuflags=-DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x4000 -DMMU_SEC_HEAP=0x40108000 -DMMU_SEC_HEAP_SIZE=0x4000
espresso_lite_v2.menu.mmu.ext128k=128K External 23LC1024
espresso_lite_v2.menu.mmu.ext128k.build.mmuflags=-DMMU_EXTERNAL_HEAP=128 -DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x8000
espresso_lite_v2.menu.mmu.ext1024k=1M External 64 MBit PSRAM
espresso_lite_v2.menu.mmu.ext1024k.build.mmuflags=-DMMU_EXTERNAL_HEAP=256 -DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x8000
espresso_lite_v2.menu.non32xfer.fast=Use pgm_read macros for IRAM/PROGMEM
espresso_lite_v2.menu.non32xfer.fast.build.non32xferflags=
espresso_lite_v2.menu.non32xfer.safe=Byte/Word access to IRAM/PROGMEM (very slow)
espresso_lite_v2.menu.non32xfer.safe.build.non32xferflags=-DNON32XFER_HANDLER
espresso_lite_v2.build.flash_mode=dio
espresso_lite_v2.build.flash_flags=-DFLASHMODE_DIO
espresso_lite_v2.build.flash_freq=40
espresso_lite_v2.menu.eesz.4M2M=4MB (FS:2MB OTA:~1019KB)
espresso_lite_v2.menu.eesz.4M2M.build.flash_size=4M
espresso_lite_v2.menu.eesz.4M2M.build.flash_ld=eagle.flash.4m2m.ld
espresso_lite_v2.menu.eesz.4M2M.build.spiffs_pagesize=256
espresso_lite_v2.menu.eesz.4M2M.build.rfcal_addr=0x3FC000
espresso_lite_v2.menu.eesz.4M2M.build.spiffs_start=0x200000
espresso_lite_v2.menu.eesz.4M2M.build.spiffs_end=0x3FA000
espresso_lite_v2.menu.eesz.4M2M.build.spiffs_blocksize=8192
espresso_lite_v2.menu.eesz.4M3M=4MB (FS:3MB OTA:~512KB)
espresso_lite_v2.menu.eesz.4M3M.build.flash_size=4M
espresso_lite_v2.menu.eesz.4M3M.build.flash_ld=eagle.flash.4m3m.ld
espresso_lite_v2.menu.eesz.4M3M.build.spiffs_pagesize=256
espresso_lite_v2.menu.eesz.4M3M.build.rfcal_addr=0x3FC000
espresso_lite_v2.menu.eesz.4M3M.build.spiffs_start=0x100000
espresso_lite_v2.menu.eesz.4M3M.build.spiffs_end=0x3FA000
espresso_lite_v2.menu.eesz.4M3M.build.spiffs_blocksize=8192
espresso_lite_v2.menu.eesz.4M1M=4MB (FS:1MB OTA:~1019KB)
espresso_lite_v2.menu.eesz.4M1M.build.flash_size=4M
espresso_lite_v2.menu.eesz.4M1M.build.flash_ld=eagle.flash.4m1m.ld
espresso_lite_v2.menu.eesz.4M1M.build.spiffs_pagesize=256
espresso_lite_v2.menu.eesz.4M1M.build.rfcal_addr=0x3FC000
espresso_lite_v2.menu.eesz.4M1M.build.spiffs_start=0x300000
espresso_lite_v2.menu.eesz.4M1M.build.spiffs_end=0x3FA000
espresso_lite_v2.menu.eesz.4M1M.build.spiffs_blocksize=8192
espresso_lite_v2.menu.eesz.4M=4MB (FS:none OTA:~1019KB)
espresso_lite_v2.menu.eesz.4M.build.flash_size=4M
espresso_lite_v2.menu.eesz.4M.build.flash_ld=eagle.flash.4m.ld
espresso_lite_v2.menu.eesz.4M.build.spiffs_pagesize=256
espresso_lite_v2.menu.eesz.4M.build.rfcal_addr=0x3FC000
espresso_lite_v2.menu.ResetMethod.nodemcu=dtr (aka nodemcu)
espresso_lite_v2.menu.ResetMethod.nodemcu.upload.resetmethod=--before default_reset --after hard_reset
espresso_lite_v2.menu.ResetMethod.ck=no dtr (aka ck)
espresso_lite_v2.menu.ResetMethod.ck.upload.resetmethod=--before no_reset --after soft_reset
espresso_lite_v2.menu.ip.lm2f=v2 Lower Memory
espresso_lite_v2.menu.ip.lm2f.build.lwip_include=lwip2/include
espresso_lite_v2.menu.ip.lm2f.build.lwip_lib=-llwip2-536-feat
espresso_lite_v2.menu.ip.lm2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
espresso_lite_v2.menu.ip.hb2f=v2 Higher Bandwidth
espresso_lite_v2.menu.ip.hb2f.build.lwip_include=lwip2/include
espresso_lite_v2.menu.ip.hb2f.build.lwip_lib=-llwip2-1460-feat
espresso_lite_v2.menu.ip.hb2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
espresso_lite_v2.menu.ip.lm2n=v2 Lower Memory (no features)
espresso_lite_v2.menu.ip.lm2n.build.lwip_include=lwip2/include
espresso_lite_v2.menu.ip.lm2n.build.lwip_lib=-llwip2-536
espresso_lite_v2.menu.ip.lm2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
espresso_lite_v2.menu.ip.hb2n=v2 Higher Bandwidth (no features)
espresso_lite_v2.menu.ip.hb2n.build.lwip_include=lwip2/include
espresso_lite_v2.menu.ip.hb2n.build.lwip_lib=-llwip2-1460
espresso_lite_v2.menu.ip.hb2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
espresso_lite_v2.menu.ip.lm6f=v2 IPv6 Lower Memory
espresso_lite_v2.menu.ip.lm6f.build.lwip_include=lwip2/include
espresso_lite_v2.menu.ip.lm6f.build.lwip_lib=-llwip6-536-feat
espresso_lite_v2.menu.ip.lm6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
espresso_lite_v2.menu.ip.hb6f=v2 IPv6 Higher Bandwidth
espresso_lite_v2.menu.ip.hb6f.build.lwip_include=lwip2/include
espresso_lite_v2.menu.ip.hb6f.build.lwip_lib=-llwip6-1460-feat
espresso_lite_v2.menu.ip.hb6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
espresso_lite_v2.menu.dbg.Disabled=Disabled
espresso_lite_v2.menu.dbg.Disabled.build.debug_port=
espresso_lite_v2.menu.dbg.Serial=Serial
espresso_lite_v2.menu.dbg.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
espresso_lite_v2.menu.dbg.Serial1=Serial1
espresso_lite_v2.menu.dbg.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
espresso_lite_v2.menu.lvl.None____=None
espresso_lite_v2.menu.lvl.None____.build.debug_level=
espresso_lite_v2.menu.lvl.SSL=SSL
espresso_lite_v2.menu.lvl.SSL.build.debug_level= -DDEBUG_ESP_SSL
espresso_lite_v2.menu.lvl.TLS_MEM=TLS_MEM
espresso_lite_v2.menu.lvl.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
espresso_lite_v2.menu.lvl.HTTP_CLIENT=HTTP_CLIENT
espresso_lite_v2.menu.lvl.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
espresso_lite_v2.menu.lvl.HTTP_SERVER=HTTP_SERVER
espresso_lite_v2.menu.lvl.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
espresso_lite_v2.menu.lvl.SSLTLS_MEM=SSL+TLS_MEM
espresso_lite_v2.menu.lvl.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
espresso_lite_v2.menu.lvl.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
espresso_lite_v2.menu.lvl.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
espresso_lite_v2.menu.lvl.SSLHTTP_SERVER=SSL+HTTP_SERVER
espresso_lite_v2.menu.lvl.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
espresso_lite_v2.menu.lvl.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
espresso_lite_v2.menu.lvl.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
espresso_lite_v2.menu.lvl.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
espresso_lite_v2.menu.lvl.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
espresso_lite_v2.menu.lvl.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
espresso_lite_v2.menu.lvl.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
espresso_lite_v2.menu.lvl.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
espresso_lite_v2.menu.lvl.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
espresso_lite_v2.menu.lvl.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
espresso_lite_v2.menu.lvl.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
espresso_lite_v2.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
espresso_lite_v2.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
espresso_lite_v2.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
espresso_lite_v2.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
espresso_lite_v2.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
espresso_lite_v2.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
espresso_lite_v2.menu.lvl.CORE=CORE
espresso_lite_v2.menu.lvl.CORE.build.debug_level= -DDEBUG_ESP_CORE
espresso_lite_v2.menu.lvl.WIFI=WIFI
espresso_lite_v2.menu.lvl.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
espresso_lite_v2.menu.lvl.HTTP_UPDATE=HTTP_UPDATE
espresso_lite_v2.menu.lvl.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
espresso_lite_v2.menu.lvl.UPDATER=UPDATER
espresso_lite_v2.menu.lvl.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
espresso_lite_v2.menu.lvl.OTA=OTA
espresso_lite_v2.menu.lvl.OTA.build.debug_level= -DDEBUG_ESP_OTA
espresso_lite_v2.menu.lvl.OOM=OOM
espresso_lite_v2.menu.lvl.OOM.build.debug_level= -DDEBUG_ESP_OOM
espresso_lite_v2.menu.lvl.MDNS=MDNS
espresso_lite_v2.menu.lvl.MDNS.build.debug_level= -DDEBUG_ESP_MDNS
espresso_lite_v2.menu.lvl.HWDT=HWDT
espresso_lite_v2.menu.lvl.HWDT.build.debug_level= -DDEBUG_ESP_HWDT
espresso_lite_v2.menu.lvl.HWDT_NOEXTRA4K=HWDT_NOEXTRA4K
espresso_lite_v2.menu.lvl.HWDT_NOEXTRA4K.build.debug_level= -DDEBUG_ESP_HWDT_NOEXTRA4K
espresso_lite_v2.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS
espresso_lite_v2.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS
espresso_lite_v2.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT
espresso_lite_v2.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT
espresso_lite_v2.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT_NOEXTRA4K
espresso_lite_v2.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT_NOEXTRA4K
espresso_lite_v2.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS
espresso_lite_v2.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS
espresso_lite_v2.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT
espresso_lite_v2.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT
espresso_lite_v2.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT_NOEXTRA4K
espresso_lite_v2.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT_NOEXTRA4K
espresso_lite_v2.menu.lvl.NoAssert-NDEBUG=NoAssert-NDEBUG
espresso_lite_v2.menu.lvl.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
espresso_lite_v2.menu.wipe.none=Only Sketch
espresso_lite_v2.menu.wipe.none.upload.erase_cmd=
espresso_lite_v2.menu.wipe.sdk=Sketch + WiFi Settings
espresso_lite_v2.menu.wipe.sdk.upload.erase_cmd=erase_region "{build.rfcal_addr}" 0x4000
espresso_lite_v2.menu.wipe.all=All Flash Contents
espresso_lite_v2.menu.wipe.all.upload.erase_cmd=erase_flash
espresso_lite_v2.menu.baud.115200=115200
espresso_lite_v2.menu.baud.115200.upload.speed=115200
espresso_lite_v2.menu.baud.57600=57600
espresso_lite_v2.menu.baud.57600.upload.speed=57600
espresso_lite_v2.menu.baud.230400.linux=230400
espresso_lite_v2.menu.baud.230400.macosx=230400
espresso_lite_v2.menu.baud.230400.upload.speed=230400
espresso_lite_v2.menu.baud.256000.windows=256000
espresso_lite_v2.menu.baud.256000.upload.speed=256000
espresso_lite_v2.menu.baud.460800.linux=460800
espresso_lite_v2.menu.baud.460800.macosx=460800
espresso_lite_v2.menu.baud.460800.upload.speed=460800
espresso_lite_v2.menu.baud.512000.windows=512000
espresso_lite_v2.menu.baud.512000.upload.speed=512000
espresso_lite_v2.menu.baud.921600=921600
espresso_lite_v2.menu.baud.921600.upload.speed=921600
espresso_lite_v2.menu.baud.3000000=3000000
espresso_lite_v2.menu.baud.3000000.upload.speed=3000000
espresso_lite_v2.menu.eesz.autoflash=Mapping defined by Hardware and Sketch
espresso_lite_v2.menu.eesz.autoflash.build.flash_size=16M
espresso_lite_v2.menu.eesz.autoflash.build.flash_ld=eagle.flash.auto.ld
espresso_lite_v2.menu.eesz.autoflash.build.extra_flags=-DAUTOFLASHSIZE=1
espresso_lite_v2.menu.eesz.autoflash.upload.maximum_size=1044464

