esp8266/Arduino/boards.txt
##############################################################
sonoff.name=ITEAD Sonoff
sonoff.build.board=ESP8266_SONOFF_SV
sonoff.build.flash_size=1M
sonoff.build.variant=itead
sonoff.menu.BoardModel.sonoffBasic=ITEAD Sonoff Basic
sonoff.menu.BoardModel.sonoffBasic.build.board=ESP8266_SONOFF_BASIC
sonoff.menu.BoardModel.sonoffS20=ITEAD Sonoff S20
sonoff.menu.BoardModel.sonoffS20.build.board=ESP8266_SONOFF_S20
sonoff.menu.BoardModel.sonoffSV=ITEAD Sonoff SV
sonoff.menu.BoardModel.sonoffSV.build.board=ESP8266_SONOFF_SV
sonoff.menu.BoardModel.sonoffTH=ITEAD Sonoff TH
sonoff.menu.BoardModel.sonoffTH.build.board=ESP8266_SONOFF_TH
sonoff.upload.tool=esptool
sonoff.upload.maximum_data_size=81920
sonoff.upload.wait_for_upload_port=true
sonoff.upload.erase_cmd=
sonoff.serial.disableDTR=true
sonoff.serial.disableRTS=true
sonoff.build.mcu=esp8266
sonoff.build.core=esp8266
sonoff.build.spiffs_pagesize=256
sonoff.build.debug_port=
sonoff.build.debug_level=
sonoff.menu.xtal.80=80 MHz
sonoff.menu.xtal.80.build.f_cpu=80000000L
sonoff.menu.xtal.160=160 MHz
sonoff.menu.xtal.160.build.f_cpu=160000000L
sonoff.menu.vt.flash=Flash
sonoff.menu.vt.flash.build.vtable_flags=-DVTABLES_IN_FLASH
sonoff.menu.vt.heap=Heap
sonoff.menu.vt.heap.build.vtable_flags=-DVTABLES_IN_DRAM
sonoff.menu.vt.iram=IRAM
sonoff.menu.vt.iram.build.vtable_flags=-DVTABLES_IN_IRAM
sonoff.menu.exception.disabled=Disabled (new aborts on oom)
sonoff.menu.exception.disabled.build.exception_flags=-fno-exceptions
sonoff.menu.exception.disabled.build.stdcpp_lib=-lstdc++
sonoff.menu.exception.enabled=Enabled
sonoff.menu.exception.enabled.build.exception_flags=-fexceptions
sonoff.menu.exception.enabled.build.stdcpp_lib=-lstdc++-exc
sonoff.menu.stacksmash.disabled=Disabled
sonoff.menu.stacksmash.disabled.build.stacksmash_flags=
sonoff.menu.stacksmash.enabled=Enabled
sonoff.menu.stacksmash.enabled.build.stacksmash_flags=-fstack-protector
sonoff.menu.ssl.all=All SSL ciphers (most compatible)
sonoff.menu.ssl.all.build.sslflags=
sonoff.menu.ssl.basic=Basic SSL ciphers (lower ROM use)
sonoff.menu.ssl.basic.build.sslflags=-DBEARSSL_SSL_BASIC
sonoff.menu.mmu.3232=32KB cache + 32KB IRAM (balanced)
sonoff.menu.mmu.3232.build.mmuflags=-DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x8000
sonoff.menu.mmu.4816=16KB cache + 48KB IRAM (IRAM)
sonoff.menu.mmu.4816.build.mmuflags=-DMMU_IRAM_SIZE=0xC000 -DMMU_ICACHE_SIZE=0x4000
sonoff.menu.mmu.4816H=16KB cache + 48KB IRAM and 2nd Heap (shared)
sonoff.menu.mmu.4816H.build.mmuflags=-DMMU_IRAM_SIZE=0xC000 -DMMU_ICACHE_SIZE=0x4000 -DMMU_IRAM_HEAP
sonoff.menu.mmu.3216=16KB cache + 32KB IRAM + 16KB 2nd Heap (not shared)
sonoff.menu.mmu.3216.build.mmuflags=-DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x4000 -DMMU_SEC_HEAP=0x40108000 -DMMU_SEC_HEAP_SIZE=0x4000
sonoff.menu.mmu.ext128k=128K External 23LC1024
sonoff.menu.mmu.ext128k.build.mmuflags=-DMMU_EXTERNAL_HEAP=128 -DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x8000
sonoff.menu.mmu.ext1024k=1M External 64 MBit PSRAM
sonoff.menu.mmu.ext1024k.build.mmuflags=-DMMU_EXTERNAL_HEAP=256 -DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x8000
sonoff.menu.non32xfer.fast=Use pgm_read macros for IRAM/PROGMEM
sonoff.menu.non32xfer.fast.build.non32xferflags=
sonoff.menu.non32xfer.safe=Byte/Word access to IRAM/PROGMEM (very slow)
sonoff.menu.non32xfer.safe.build.non32xferflags=-DNON32XFER_HANDLER
sonoff.upload.resetmethod=--before no_reset --after soft_reset
sonoff.build.flash_mode=dout
sonoff.build.flash_flags=-DFLASHMODE_DOUT
sonoff.build.flash_freq=40
sonoff.menu.eesz.1M64=1MB (FS:64KB OTA:~470KB)
sonoff.menu.eesz.1M64.build.flash_size=1M
sonoff.menu.eesz.1M64.build.flash_ld=eagle.flash.1m64.ld
sonoff.menu.eesz.1M64.build.spiffs_pagesize=256
sonoff.menu.eesz.1M64.build.rfcal_addr=0xFC000
sonoff.menu.eesz.1M64.build.spiffs_start=0xEB000
sonoff.menu.eesz.1M64.build.spiffs_end=0xFB000
sonoff.menu.eesz.1M64.build.spiffs_blocksize=4096
sonoff.menu.eesz.1M128=1MB (FS:128KB OTA:~438KB)
sonoff.menu.eesz.1M128.build.flash_size=1M
sonoff.menu.eesz.1M128.build.flash_ld=eagle.flash.1m128.ld
sonoff.menu.eesz.1M128.build.spiffs_pagesize=256
sonoff.menu.eesz.1M128.build.rfcal_addr=0xFC000
sonoff.menu.eesz.1M128.build.spiffs_start=0xDB000
sonoff.menu.eesz.1M128.build.spiffs_end=0xFB000
sonoff.menu.eesz.1M128.build.spiffs_blocksize=4096
sonoff.menu.eesz.1M144=1MB (FS:144KB OTA:~430KB)
sonoff.menu.eesz.1M144.build.flash_size=1M
sonoff.menu.eesz.1M144.build.flash_ld=eagle.flash.1m144.ld
sonoff.menu.eesz.1M144.build.spiffs_pagesize=256
sonoff.menu.eesz.1M144.build.rfcal_addr=0xFC000
sonoff.menu.eesz.1M144.build.spiffs_start=0xD7000
sonoff.menu.eesz.1M144.build.spiffs_end=0xFB000
sonoff.menu.eesz.1M144.build.spiffs_blocksize=4096
sonoff.menu.eesz.1M160=1MB (FS:160KB OTA:~422KB)
sonoff.menu.eesz.1M160.build.flash_size=1M
sonoff.menu.eesz.1M160.build.flash_ld=eagle.flash.1m160.ld
sonoff.menu.eesz.1M160.build.spiffs_pagesize=256
sonoff.menu.eesz.1M160.build.rfcal_addr=0xFC000
sonoff.menu.eesz.1M160.build.spiffs_start=0xD3000
sonoff.menu.eesz.1M160.build.spiffs_end=0xFB000
sonoff.menu.eesz.1M160.build.spiffs_blocksize=4096
sonoff.menu.eesz.1M192=1MB (FS:192KB OTA:~406KB)
sonoff.menu.eesz.1M192.build.flash_size=1M
sonoff.menu.eesz.1M192.build.flash_ld=eagle.flash.1m192.ld
sonoff.menu.eesz.1M192.build.spiffs_pagesize=256
sonoff.menu.eesz.1M192.build.rfcal_addr=0xFC000
sonoff.menu.eesz.1M192.build.spiffs_start=0xCB000
sonoff.menu.eesz.1M192.build.spiffs_end=0xFB000
sonoff.menu.eesz.1M192.build.spiffs_blocksize=4096
sonoff.menu.eesz.1M256=1MB (FS:256KB OTA:~374KB)
sonoff.menu.eesz.1M256.build.flash_size=1M
sonoff.menu.eesz.1M256.build.flash_ld=eagle.flash.1m256.ld
sonoff.menu.eesz.1M256.build.spiffs_pagesize=256
sonoff.menu.eesz.1M256.build.rfcal_addr=0xFC000
sonoff.menu.eesz.1M256.build.spiffs_start=0xBB000
sonoff.menu.eesz.1M256.build.spiffs_end=0xFB000
sonoff.menu.eesz.1M256.build.spiffs_blocksize=4096
sonoff.menu.eesz.1M512=1MB (FS:512KB OTA:~246KB)
sonoff.menu.eesz.1M512.build.flash_size=1M
sonoff.menu.eesz.1M512.build.flash_ld=eagle.flash.1m512.ld
sonoff.menu.eesz.1M512.build.spiffs_pagesize=256
sonoff.menu.eesz.1M512.build.rfcal_addr=0xFC000
sonoff.menu.eesz.1M512.build.spiffs_start=0x7B000
sonoff.menu.eesz.1M512.build.spiffs_end=0xFB000
sonoff.menu.eesz.1M512.build.spiffs_blocksize=8192
sonoff.menu.eesz.1M=1MB (FS:none OTA:~502KB)
sonoff.menu.eesz.1M.build.flash_size=1M
sonoff.menu.eesz.1M.build.flash_ld=eagle.flash.1m.ld
sonoff.menu.eesz.1M.build.spiffs_pagesize=256
sonoff.menu.eesz.1M.build.rfcal_addr=0xFC000
sonoff.menu.ip.lm2f=v2 Lower Memory
sonoff.menu.ip.lm2f.build.lwip_include=lwip2/include
sonoff.menu.ip.lm2f.build.lwip_lib=-llwip2-536-feat
sonoff.menu.ip.lm2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
sonoff.menu.ip.hb2f=v2 Higher Bandwidth
sonoff.menu.ip.hb2f.build.lwip_include=lwip2/include
sonoff.menu.ip.hb2f.build.lwip_lib=-llwip2-1460-feat
sonoff.menu.ip.hb2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
sonoff.menu.ip.lm2n=v2 Lower Memory (no features)
sonoff.menu.ip.lm2n.build.lwip_include=lwip2/include
sonoff.menu.ip.lm2n.build.lwip_lib=-llwip2-536
sonoff.menu.ip.lm2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
sonoff.menu.ip.hb2n=v2 Higher Bandwidth (no features)
sonoff.menu.ip.hb2n.build.lwip_include=lwip2/include
sonoff.menu.ip.hb2n.build.lwip_lib=-llwip2-1460
sonoff.menu.ip.hb2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
sonoff.menu.ip.lm6f=v2 IPv6 Lower Memory
sonoff.menu.ip.lm6f.build.lwip_include=lwip2/include
sonoff.menu.ip.lm6f.build.lwip_lib=-llwip6-536-feat
sonoff.menu.ip.lm6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
sonoff.menu.ip.hb6f=v2 IPv6 Higher Bandwidth
sonoff.menu.ip.hb6f.build.lwip_include=lwip2/include
sonoff.menu.ip.hb6f.build.lwip_lib=-llwip6-1460-feat
sonoff.menu.ip.hb6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
sonoff.menu.dbg.Disabled=Disabled
sonoff.menu.dbg.Disabled.build.debug_port=
sonoff.menu.dbg.Serial=Serial
sonoff.menu.dbg.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
sonoff.menu.dbg.Serial1=Serial1
sonoff.menu.dbg.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
sonoff.menu.lvl.None____=None
sonoff.menu.lvl.None____.build.debug_level=
sonoff.menu.lvl.SSL=SSL
sonoff.menu.lvl.SSL.build.debug_level= -DDEBUG_ESP_SSL
sonoff.menu.lvl.TLS_MEM=TLS_MEM
sonoff.menu.lvl.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
sonoff.menu.lvl.HTTP_CLIENT=HTTP_CLIENT
sonoff.menu.lvl.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
sonoff.menu.lvl.HTTP_SERVER=HTTP_SERVER
sonoff.menu.lvl.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
sonoff.menu.lvl.SSLTLS_MEM=SSL+TLS_MEM
sonoff.menu.lvl.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
sonoff.menu.lvl.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
sonoff.menu.lvl.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
sonoff.menu.lvl.SSLHTTP_SERVER=SSL+HTTP_SERVER
sonoff.menu.lvl.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
sonoff.menu.lvl.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
sonoff.menu.lvl.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
sonoff.menu.lvl.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
sonoff.menu.lvl.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
sonoff.menu.lvl.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
sonoff.menu.lvl.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
sonoff.menu.lvl.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
sonoff.menu.lvl.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
sonoff.menu.lvl.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
sonoff.menu.lvl.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
sonoff.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
sonoff.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
sonoff.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
sonoff.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
sonoff.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
sonoff.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
sonoff.menu.lvl.CORE=CORE
sonoff.menu.lvl.CORE.build.debug_level= -DDEBUG_ESP_CORE
sonoff.menu.lvl.WIFI=WIFI
sonoff.menu.lvl.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
sonoff.menu.lvl.HTTP_UPDATE=HTTP_UPDATE
sonoff.menu.lvl.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
sonoff.menu.lvl.UPDATER=UPDATER
sonoff.menu.lvl.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
sonoff.menu.lvl.OTA=OTA
sonoff.menu.lvl.OTA.build.debug_level= -DDEBUG_ESP_OTA
sonoff.menu.lvl.OOM=OOM
sonoff.menu.lvl.OOM.build.debug_level= -DDEBUG_ESP_OOM
sonoff.menu.lvl.MDNS=MDNS
sonoff.menu.lvl.MDNS.build.debug_level= -DDEBUG_ESP_MDNS
sonoff.menu.lvl.HWDT=HWDT
sonoff.menu.lvl.HWDT.build.debug_level= -DDEBUG_ESP_HWDT
sonoff.menu.lvl.HWDT_NOEXTRA4K=HWDT_NOEXTRA4K
sonoff.menu.lvl.HWDT_NOEXTRA4K.build.debug_level= -DDEBUG_ESP_HWDT_NOEXTRA4K
sonoff.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS
sonoff.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS
sonoff.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT
sonoff.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT
sonoff.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT_NOEXTRA4K
sonoff.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT_NOEXTRA4K
sonoff.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS
sonoff.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS
sonoff.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT
sonoff.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT
sonoff.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT_NOEXTRA4K
sonoff.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT_NOEXTRA4K
sonoff.menu.lvl.NoAssert-NDEBUG=NoAssert-NDEBUG
sonoff.menu.lvl.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
sonoff.menu.wipe.none=Only Sketch
sonoff.menu.wipe.none.upload.erase_cmd=
sonoff.menu.wipe.sdk=Sketch + WiFi Settings
sonoff.menu.wipe.sdk.upload.erase_cmd=erase_region "{build.rfcal_addr}" 0x4000
sonoff.menu.wipe.all=All Flash Contents
sonoff.menu.wipe.all.upload.erase_cmd=erase_flash
sonoff.menu.baud.115200=115200
sonoff.menu.baud.115200.upload.speed=115200
sonoff.menu.baud.57600=57600
sonoff.menu.baud.57600.upload.speed=57600
sonoff.menu.baud.230400.linux=230400
sonoff.menu.baud.230400.macosx=230400
sonoff.menu.baud.230400.upload.speed=230400
sonoff.menu.baud.256000.windows=256000
sonoff.menu.baud.256000.upload.speed=256000
sonoff.menu.baud.460800.linux=460800
sonoff.menu.baud.460800.macosx=460800
sonoff.menu.baud.460800.upload.speed=460800
sonoff.menu.baud.512000.windows=512000
sonoff.menu.baud.512000.upload.speed=512000
sonoff.menu.baud.921600=921600
sonoff.menu.baud.921600.upload.speed=921600
sonoff.menu.baud.3000000=3000000
sonoff.menu.baud.3000000.upload.speed=3000000
sonoff.menu.eesz.autoflash=Mapping defined by Hardware and Sketch
sonoff.menu.eesz.autoflash.build.flash_size=16M
sonoff.menu.eesz.autoflash.build.flash_ld=eagle.flash.auto.ld
sonoff.menu.eesz.autoflash.build.extra_flags=-DAUTOFLASHSIZE=1
sonoff.menu.eesz.autoflash.upload.maximum_size=1044464

