esp8266/Arduino/boards.txt
##############################################################
phoenix_v1.name=Phoenix 1.0
phoenix_v1.build.board=ESP8266_PHOENIX_V1
phoenix_v1.build.variant=phoenix_v1
phoenix_v1.upload.tool=esptool
phoenix_v1.upload.maximum_data_size=81920
phoenix_v1.upload.wait_for_upload_port=true
phoenix_v1.upload.erase_cmd=
phoenix_v1.serial.disableDTR=true
phoenix_v1.serial.disableRTS=true
phoenix_v1.build.mcu=esp8266
phoenix_v1.build.core=esp8266
phoenix_v1.build.spiffs_pagesize=256
phoenix_v1.build.debug_port=
phoenix_v1.build.debug_level=
phoenix_v1.menu.xtal.80=80 MHz
phoenix_v1.menu.xtal.80.build.f_cpu=80000000L
phoenix_v1.menu.xtal.160=160 MHz
phoenix_v1.menu.xtal.160.build.f_cpu=160000000L
phoenix_v1.menu.vt.flash=Flash
phoenix_v1.menu.vt.flash.build.vtable_flags=-DVTABLES_IN_FLASH
phoenix_v1.menu.vt.heap=Heap
phoenix_v1.menu.vt.heap.build.vtable_flags=-DVTABLES_IN_DRAM
phoenix_v1.menu.vt.iram=IRAM
phoenix_v1.menu.vt.iram.build.vtable_flags=-DVTABLES_IN_IRAM
phoenix_v1.menu.exception.disabled=Disabled (new aborts on oom)
phoenix_v1.menu.exception.disabled.build.exception_flags=-fno-exceptions
phoenix_v1.menu.exception.disabled.build.stdcpp_lib=-lstdc++
phoenix_v1.menu.exception.enabled=Enabled
phoenix_v1.menu.exception.enabled.build.exception_flags=-fexceptions
phoenix_v1.menu.exception.enabled.build.stdcpp_lib=-lstdc++-exc
phoenix_v1.menu.stacksmash.disabled=Disabled
phoenix_v1.menu.stacksmash.disabled.build.stacksmash_flags=
phoenix_v1.menu.stacksmash.enabled=Enabled
phoenix_v1.menu.stacksmash.enabled.build.stacksmash_flags=-fstack-protector
phoenix_v1.menu.ssl.all=All SSL ciphers (most compatible)
phoenix_v1.menu.ssl.all.build.sslflags=
phoenix_v1.menu.ssl.basic=Basic SSL ciphers (lower ROM use)
phoenix_v1.menu.ssl.basic.build.sslflags=-DBEARSSL_SSL_BASIC
phoenix_v1.menu.mmu.3232=32KB cache + 32KB IRAM (balanced)
phoenix_v1.menu.mmu.3232.build.mmuflags=-DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x8000
phoenix_v1.menu.mmu.4816=16KB cache + 48KB IRAM (IRAM)
phoenix_v1.menu.mmu.4816.build.mmuflags=-DMMU_IRAM_SIZE=0xC000 -DMMU_ICACHE_SIZE=0x4000
phoenix_v1.menu.mmu.4816H=16KB cache + 48KB IRAM and 2nd Heap (shared)
phoenix_v1.menu.mmu.4816H.build.mmuflags=-DMMU_IRAM_SIZE=0xC000 -DMMU_ICACHE_SIZE=0x4000 -DMMU_IRAM_HEAP
phoenix_v1.menu.mmu.3216=16KB cache + 32KB IRAM + 16KB 2nd Heap (not shared)
phoenix_v1.menu.mmu.3216.build.mmuflags=-DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x4000 -DMMU_SEC_HEAP=0x40108000 -DMMU_SEC_HEAP_SIZE=0x4000
phoenix_v1.menu.mmu.ext128k=128K External 23LC1024
phoenix_v1.menu.mmu.ext128k.build.mmuflags=-DMMU_EXTERNAL_HEAP=128 -DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x8000
phoenix_v1.menu.mmu.ext1024k=1M External 64 MBit PSRAM
phoenix_v1.menu.mmu.ext1024k.build.mmuflags=-DMMU_EXTERNAL_HEAP=256 -DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x8000
phoenix_v1.menu.non32xfer.fast=Use pgm_read macros for IRAM/PROGMEM
phoenix_v1.menu.non32xfer.fast.build.non32xferflags=
phoenix_v1.menu.non32xfer.safe=Byte/Word access to IRAM/PROGMEM (very slow)
phoenix_v1.menu.non32xfer.safe.build.non32xferflags=-DNON32XFER_HANDLER
phoenix_v1.build.flash_mode=dio
phoenix_v1.build.flash_flags=-DFLASHMODE_DIO
phoenix_v1.build.flash_freq=40
phoenix_v1.menu.eesz.4M2M=4MB (FS:2MB OTA:~1019KB)
phoenix_v1.menu.eesz.4M2M.build.flash_size=4M
phoenix_v1.menu.eesz.4M2M.build.flash_ld=eagle.flash.4m2m.ld
phoenix_v1.menu.eesz.4M2M.build.spiffs_pagesize=256
phoenix_v1.menu.eesz.4M2M.build.rfcal_addr=0x3FC000
phoenix_v1.menu.eesz.4M2M.build.spiffs_start=0x200000
phoenix_v1.menu.eesz.4M2M.build.spiffs_end=0x3FA000
phoenix_v1.menu.eesz.4M2M.build.spiffs_blocksize=8192
phoenix_v1.menu.eesz.4M3M=4MB (FS:3MB OTA:~512KB)
phoenix_v1.menu.eesz.4M3M.build.flash_size=4M
phoenix_v1.menu.eesz.4M3M.build.flash_ld=eagle.flash.4m3m.ld
phoenix_v1.menu.eesz.4M3M.build.spiffs_pagesize=256
phoenix_v1.menu.eesz.4M3M.build.rfcal_addr=0x3FC000
phoenix_v1.menu.eesz.4M3M.build.spiffs_start=0x100000
phoenix_v1.menu.eesz.4M3M.build.spiffs_end=0x3FA000
phoenix_v1.menu.eesz.4M3M.build.spiffs_blocksize=8192
phoenix_v1.menu.eesz.4M1M=4MB (FS:1MB OTA:~1019KB)
phoenix_v1.menu.eesz.4M1M.build.flash_size=4M
phoenix_v1.menu.eesz.4M1M.build.flash_ld=eagle.flash.4m1m.ld
phoenix_v1.menu.eesz.4M1M.build.spiffs_pagesize=256
phoenix_v1.menu.eesz.4M1M.build.rfcal_addr=0x3FC000
phoenix_v1.menu.eesz.4M1M.build.spiffs_start=0x300000
phoenix_v1.menu.eesz.4M1M.build.spiffs_end=0x3FA000
phoenix_v1.menu.eesz.4M1M.build.spiffs_blocksize=8192
phoenix_v1.menu.eesz.4M=4MB (FS:none OTA:~1019KB)
phoenix_v1.menu.eesz.4M.build.flash_size=4M
phoenix_v1.menu.eesz.4M.build.flash_ld=eagle.flash.4m.ld
phoenix_v1.menu.eesz.4M.build.spiffs_pagesize=256
phoenix_v1.menu.eesz.4M.build.rfcal_addr=0x3FC000
phoenix_v1.menu.ResetMethod.nodemcu=dtr (aka nodemcu)
phoenix_v1.menu.ResetMethod.nodemcu.upload.resetmethod=--before default_reset --after hard_reset
phoenix_v1.menu.ResetMethod.ck=no dtr (aka ck)
phoenix_v1.menu.ResetMethod.ck.upload.resetmethod=--before no_reset --after soft_reset
phoenix_v1.menu.ip.lm2f=v2 Lower Memory
phoenix_v1.menu.ip.lm2f.build.lwip_include=lwip2/include
phoenix_v1.menu.ip.lm2f.build.lwip_lib=-llwip2-536-feat
phoenix_v1.menu.ip.lm2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
phoenix_v1.menu.ip.hb2f=v2 Higher Bandwidth
phoenix_v1.menu.ip.hb2f.build.lwip_include=lwip2/include
phoenix_v1.menu.ip.hb2f.build.lwip_lib=-llwip2-1460-feat
phoenix_v1.menu.ip.hb2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
phoenix_v1.menu.ip.lm2n=v2 Lower Memory (no features)
phoenix_v1.menu.ip.lm2n.build.lwip_include=lwip2/include
phoenix_v1.menu.ip.lm2n.build.lwip_lib=-llwip2-536
phoenix_v1.menu.ip.lm2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
phoenix_v1.menu.ip.hb2n=v2 Higher Bandwidth (no features)
phoenix_v1.menu.ip.hb2n.build.lwip_include=lwip2/include
phoenix_v1.menu.ip.hb2n.build.lwip_lib=-llwip2-1460
phoenix_v1.menu.ip.hb2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
phoenix_v1.menu.ip.lm6f=v2 IPv6 Lower Memory
phoenix_v1.menu.ip.lm6f.build.lwip_include=lwip2/include
phoenix_v1.menu.ip.lm6f.build.lwip_lib=-llwip6-536-feat
phoenix_v1.menu.ip.lm6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
phoenix_v1.menu.ip.hb6f=v2 IPv6 Higher Bandwidth
phoenix_v1.menu.ip.hb6f.build.lwip_include=lwip2/include
phoenix_v1.menu.ip.hb6f.build.lwip_lib=-llwip6-1460-feat
phoenix_v1.menu.ip.hb6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
phoenix_v1.menu.dbg.Disabled=Disabled
phoenix_v1.menu.dbg.Disabled.build.debug_port=
phoenix_v1.menu.dbg.Serial=Serial
phoenix_v1.menu.dbg.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
phoenix_v1.menu.dbg.Serial1=Serial1
phoenix_v1.menu.dbg.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
phoenix_v1.menu.lvl.None____=None
phoenix_v1.menu.lvl.None____.build.debug_level=
phoenix_v1.menu.lvl.SSL=SSL
phoenix_v1.menu.lvl.SSL.build.debug_level= -DDEBUG_ESP_SSL
phoenix_v1.menu.lvl.TLS_MEM=TLS_MEM
phoenix_v1.menu.lvl.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
phoenix_v1.menu.lvl.HTTP_CLIENT=HTTP_CLIENT
phoenix_v1.menu.lvl.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
phoenix_v1.menu.lvl.HTTP_SERVER=HTTP_SERVER
phoenix_v1.menu.lvl.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
phoenix_v1.menu.lvl.SSLTLS_MEM=SSL+TLS_MEM
phoenix_v1.menu.lvl.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
phoenix_v1.menu.lvl.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
phoenix_v1.menu.lvl.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
phoenix_v1.menu.lvl.SSLHTTP_SERVER=SSL+HTTP_SERVER
phoenix_v1.menu.lvl.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
phoenix_v1.menu.lvl.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
phoenix_v1.menu.lvl.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
phoenix_v1.menu.lvl.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
phoenix_v1.menu.lvl.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
phoenix_v1.menu.lvl.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
phoenix_v1.menu.lvl.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
phoenix_v1.menu.lvl.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
phoenix_v1.menu.lvl.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
phoenix_v1.menu.lvl.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
phoenix_v1.menu.lvl.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
phoenix_v1.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
phoenix_v1.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
phoenix_v1.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
phoenix_v1.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
phoenix_v1.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
phoenix_v1.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
phoenix_v1.menu.lvl.CORE=CORE
phoenix_v1.menu.lvl.CORE.build.debug_level= -DDEBUG_ESP_CORE
phoenix_v1.menu.lvl.WIFI=WIFI
phoenix_v1.menu.lvl.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
phoenix_v1.menu.lvl.HTTP_UPDATE=HTTP_UPDATE
phoenix_v1.menu.lvl.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
phoenix_v1.menu.lvl.UPDATER=UPDATER
phoenix_v1.menu.lvl.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
phoenix_v1.menu.lvl.OTA=OTA
phoenix_v1.menu.lvl.OTA.build.debug_level= -DDEBUG_ESP_OTA
phoenix_v1.menu.lvl.OOM=OOM
phoenix_v1.menu.lvl.OOM.build.debug_level= -DDEBUG_ESP_OOM
phoenix_v1.menu.lvl.MDNS=MDNS
phoenix_v1.menu.lvl.MDNS.build.debug_level= -DDEBUG_ESP_MDNS
phoenix_v1.menu.lvl.HWDT=HWDT
phoenix_v1.menu.lvl.HWDT.build.debug_level= -DDEBUG_ESP_HWDT
phoenix_v1.menu.lvl.HWDT_NOEXTRA4K=HWDT_NOEXTRA4K
phoenix_v1.menu.lvl.HWDT_NOEXTRA4K.build.debug_level= -DDEBUG_ESP_HWDT_NOEXTRA4K
phoenix_v1.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS
phoenix_v1.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS
phoenix_v1.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT
phoenix_v1.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT
phoenix_v1.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT_NOEXTRA4K
phoenix_v1.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT_NOEXTRA4K
phoenix_v1.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS
phoenix_v1.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS
phoenix_v1.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT
phoenix_v1.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT
phoenix_v1.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT_NOEXTRA4K
phoenix_v1.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT_NOEXTRA4K
phoenix_v1.menu.lvl.NoAssert-NDEBUG=NoAssert-NDEBUG
phoenix_v1.menu.lvl.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
phoenix_v1.menu.wipe.none=Only Sketch
phoenix_v1.menu.wipe.none.upload.erase_cmd=
phoenix_v1.menu.wipe.sdk=Sketch + WiFi Settings
phoenix_v1.menu.wipe.sdk.upload.erase_cmd=erase_region "{build.rfcal_addr}" 0x4000
phoenix_v1.menu.wipe.all=All Flash Contents
phoenix_v1.menu.wipe.all.upload.erase_cmd=erase_flash
phoenix_v1.menu.baud.115200=115200
phoenix_v1.menu.baud.115200.upload.speed=115200
phoenix_v1.menu.baud.57600=57600
phoenix_v1.menu.baud.57600.upload.speed=57600
phoenix_v1.menu.baud.230400.linux=230400
phoenix_v1.menu.baud.230400.macosx=230400
phoenix_v1.menu.baud.230400.upload.speed=230400
phoenix_v1.menu.baud.256000.windows=256000
phoenix_v1.menu.baud.256000.upload.speed=256000
phoenix_v1.menu.baud.460800.linux=460800
phoenix_v1.menu.baud.460800.macosx=460800
phoenix_v1.menu.baud.460800.upload.speed=460800
phoenix_v1.menu.baud.512000.windows=512000
phoenix_v1.menu.baud.512000.upload.speed=512000
phoenix_v1.menu.baud.921600=921600
phoenix_v1.menu.baud.921600.upload.speed=921600
phoenix_v1.menu.baud.3000000=3000000
phoenix_v1.menu.baud.3000000.upload.speed=3000000
phoenix_v1.menu.eesz.autoflash=Mapping defined by Hardware and Sketch
phoenix_v1.menu.eesz.autoflash.build.flash_size=16M
phoenix_v1.menu.eesz.autoflash.build.flash_ld=eagle.flash.auto.ld
phoenix_v1.menu.eesz.autoflash.build.extra_flags=-DAUTOFLASHSIZE=1
phoenix_v1.menu.eesz.autoflash.upload.maximum_size=1044464

