esp8266/Arduino/boards.txt
##############################################################
espinotee.name=ThaiEasyElec's ESPino
espinotee.build.board=ESP8266_ESPINO_ESP13
espinotee.build.variant=espinotee
espinotee.upload.tool=esptool
espinotee.upload.maximum_data_size=81920
espinotee.upload.wait_for_upload_port=true
espinotee.upload.erase_cmd=
espinotee.serial.disableDTR=true
espinotee.serial.disableRTS=true
espinotee.build.mcu=esp8266
espinotee.build.core=esp8266
espinotee.build.spiffs_pagesize=256
espinotee.build.debug_port=
espinotee.build.debug_level=
espinotee.menu.xtal.80=80 MHz
espinotee.menu.xtal.80.build.f_cpu=80000000L
espinotee.menu.xtal.160=160 MHz
espinotee.menu.xtal.160.build.f_cpu=160000000L
espinotee.menu.vt.flash=Flash
espinotee.menu.vt.flash.build.vtable_flags=-DVTABLES_IN_FLASH
espinotee.menu.vt.heap=Heap
espinotee.menu.vt.heap.build.vtable_flags=-DVTABLES_IN_DRAM
espinotee.menu.vt.iram=IRAM
espinotee.menu.vt.iram.build.vtable_flags=-DVTABLES_IN_IRAM
espinotee.menu.exception.disabled=Disabled (new aborts on oom)
espinotee.menu.exception.disabled.build.exception_flags=-fno-exceptions
espinotee.menu.exception.disabled.build.stdcpp_lib=-lstdc++
espinotee.menu.exception.enabled=Enabled
espinotee.menu.exception.enabled.build.exception_flags=-fexceptions
espinotee.menu.exception.enabled.build.stdcpp_lib=-lstdc++-exc
espinotee.menu.stacksmash.disabled=Disabled
espinotee.menu.stacksmash.disabled.build.stacksmash_flags=
espinotee.menu.stacksmash.enabled=Enabled
espinotee.menu.stacksmash.enabled.build.stacksmash_flags=-fstack-protector
espinotee.menu.ssl.all=All SSL ciphers (most compatible)
espinotee.menu.ssl.all.build.sslflags=
espinotee.menu.ssl.basic=Basic SSL ciphers (lower ROM use)
espinotee.menu.ssl.basic.build.sslflags=-DBEARSSL_SSL_BASIC
espinotee.menu.mmu.3232=32KB cache + 32KB IRAM (balanced)
espinotee.menu.mmu.3232.build.mmuflags=-DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x8000
espinotee.menu.mmu.4816=16KB cache + 48KB IRAM (IRAM)
espinotee.menu.mmu.4816.build.mmuflags=-DMMU_IRAM_SIZE=0xC000 -DMMU_ICACHE_SIZE=0x4000
espinotee.menu.mmu.4816H=16KB cache + 48KB IRAM and 2nd Heap (shared)
espinotee.menu.mmu.4816H.build.mmuflags=-DMMU_IRAM_SIZE=0xC000 -DMMU_ICACHE_SIZE=0x4000 -DMMU_IRAM_HEAP
espinotee.menu.mmu.3216=16KB cache + 32KB IRAM + 16KB 2nd Heap (not shared)
espinotee.menu.mmu.3216.build.mmuflags=-DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x4000 -DMMU_SEC_HEAP=0x40108000 -DMMU_SEC_HEAP_SIZE=0x4000
espinotee.menu.mmu.ext128k=128K External 23LC1024
espinotee.menu.mmu.ext128k.build.mmuflags=-DMMU_EXTERNAL_HEAP=128 -DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x8000
espinotee.menu.mmu.ext1024k=1M External 64 MBit PSRAM
espinotee.menu.mmu.ext1024k.build.mmuflags=-DMMU_EXTERNAL_HEAP=256 -DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x8000
espinotee.menu.non32xfer.fast=Use pgm_read macros for IRAM/PROGMEM
espinotee.menu.non32xfer.fast.build.non32xferflags=
espinotee.menu.non32xfer.safe=Byte/Word access to IRAM/PROGMEM (very slow)
espinotee.menu.non32xfer.safe.build.non32xferflags=-DNON32XFER_HANDLER
espinotee.upload.resetmethod=--before default_reset --after hard_reset
espinotee.build.flash_mode=qio
espinotee.build.flash_flags=-DFLASHMODE_QIO
espinotee.build.flash_freq=40
espinotee.menu.eesz.4M2M=4MB (FS:2MB OTA:~1019KB)
espinotee.menu.eesz.4M2M.build.flash_size=4M
espinotee.menu.eesz.4M2M.build.flash_ld=eagle.flash.4m2m.ld
espinotee.menu.eesz.4M2M.build.spiffs_pagesize=256
espinotee.menu.eesz.4M2M.build.rfcal_addr=0x3FC000
espinotee.menu.eesz.4M2M.build.spiffs_start=0x200000
espinotee.menu.eesz.4M2M.build.spiffs_end=0x3FA000
espinotee.menu.eesz.4M2M.build.spiffs_blocksize=8192
espinotee.menu.eesz.4M3M=4MB (FS:3MB OTA:~512KB)
espinotee.menu.eesz.4M3M.build.flash_size=4M
espinotee.menu.eesz.4M3M.build.flash_ld=eagle.flash.4m3m.ld
espinotee.menu.eesz.4M3M.build.spiffs_pagesize=256
espinotee.menu.eesz.4M3M.build.rfcal_addr=0x3FC000
espinotee.menu.eesz.4M3M.build.spiffs_start=0x100000
espinotee.menu.eesz.4M3M.build.spiffs_end=0x3FA000
espinotee.menu.eesz.4M3M.build.spiffs_blocksize=8192
espinotee.menu.eesz.4M1M=4MB (FS:1MB OTA:~1019KB)
espinotee.menu.eesz.4M1M.build.flash_size=4M
espinotee.menu.eesz.4M1M.build.flash_ld=eagle.flash.4m1m.ld
espinotee.menu.eesz.4M1M.build.spiffs_pagesize=256
espinotee.menu.eesz.4M1M.build.rfcal_addr=0x3FC000
espinotee.menu.eesz.4M1M.build.spiffs_start=0x300000
espinotee.menu.eesz.4M1M.build.spiffs_end=0x3FA000
espinotee.menu.eesz.4M1M.build.spiffs_blocksize=8192
espinotee.menu.eesz.4M=4MB (FS:none OTA:~1019KB)
espinotee.menu.eesz.4M.build.flash_size=4M
espinotee.menu.eesz.4M.build.flash_ld=eagle.flash.4m.ld
espinotee.menu.eesz.4M.build.spiffs_pagesize=256
espinotee.menu.eesz.4M.build.rfcal_addr=0x3FC000
espinotee.menu.ip.lm2f=v2 Lower Memory
espinotee.menu.ip.lm2f.build.lwip_include=lwip2/include
espinotee.menu.ip.lm2f.build.lwip_lib=-llwip2-536-feat
espinotee.menu.ip.lm2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
espinotee.menu.ip.hb2f=v2 Higher Bandwidth
espinotee.menu.ip.hb2f.build.lwip_include=lwip2/include
espinotee.menu.ip.hb2f.build.lwip_lib=-llwip2-1460-feat
espinotee.menu.ip.hb2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
espinotee.menu.ip.lm2n=v2 Lower Memory (no features)
espinotee.menu.ip.lm2n.build.lwip_include=lwip2/include
espinotee.menu.ip.lm2n.build.lwip_lib=-llwip2-536
espinotee.menu.ip.lm2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
espinotee.menu.ip.hb2n=v2 Higher Bandwidth (no features)
espinotee.menu.ip.hb2n.build.lwip_include=lwip2/include
espinotee.menu.ip.hb2n.build.lwip_lib=-llwip2-1460
espinotee.menu.ip.hb2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
espinotee.menu.ip.lm6f=v2 IPv6 Lower Memory
espinotee.menu.ip.lm6f.build.lwip_include=lwip2/include
espinotee.menu.ip.lm6f.build.lwip_lib=-llwip6-536-feat
espinotee.menu.ip.lm6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
espinotee.menu.ip.hb6f=v2 IPv6 Higher Bandwidth
espinotee.menu.ip.hb6f.build.lwip_include=lwip2/include
espinotee.menu.ip.hb6f.build.lwip_lib=-llwip6-1460-feat
espinotee.menu.ip.hb6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
espinotee.menu.dbg.Disabled=Disabled
espinotee.menu.dbg.Disabled.build.debug_port=
espinotee.menu.dbg.Serial=Serial
espinotee.menu.dbg.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
espinotee.menu.dbg.Serial1=Serial1
espinotee.menu.dbg.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
espinotee.menu.lvl.None____=None
espinotee.menu.lvl.None____.build.debug_level=
espinotee.menu.lvl.SSL=SSL
espinotee.menu.lvl.SSL.build.debug_level= -DDEBUG_ESP_SSL
espinotee.menu.lvl.TLS_MEM=TLS_MEM
espinotee.menu.lvl.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
espinotee.menu.lvl.HTTP_CLIENT=HTTP_CLIENT
espinotee.menu.lvl.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
espinotee.menu.lvl.HTTP_SERVER=HTTP_SERVER
espinotee.menu.lvl.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
espinotee.menu.lvl.SSLTLS_MEM=SSL+TLS_MEM
espinotee.menu.lvl.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
espinotee.menu.lvl.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
espinotee.menu.lvl.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
espinotee.menu.lvl.SSLHTTP_SERVER=SSL+HTTP_SERVER
espinotee.menu.lvl.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
espinotee.menu.lvl.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
espinotee.menu.lvl.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
espinotee.menu.lvl.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
espinotee.menu.lvl.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
espinotee.menu.lvl.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
espinotee.menu.lvl.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
espinotee.menu.lvl.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
espinotee.menu.lvl.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
espinotee.menu.lvl.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
espinotee.menu.lvl.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
espinotee.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
espinotee.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
espinotee.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
espinotee.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
espinotee.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
espinotee.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
espinotee.menu.lvl.CORE=CORE
espinotee.menu.lvl.CORE.build.debug_level= -DDEBUG_ESP_CORE
espinotee.menu.lvl.WIFI=WIFI
espinotee.menu.lvl.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
espinotee.menu.lvl.HTTP_UPDATE=HTTP_UPDATE
espinotee.menu.lvl.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
espinotee.menu.lvl.UPDATER=UPDATER
espinotee.menu.lvl.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
espinotee.menu.lvl.OTA=OTA
espinotee.menu.lvl.OTA.build.debug_level= -DDEBUG_ESP_OTA
espinotee.menu.lvl.OOM=OOM
espinotee.menu.lvl.OOM.build.debug_level= -DDEBUG_ESP_OOM
espinotee.menu.lvl.MDNS=MDNS
espinotee.menu.lvl.MDNS.build.debug_level= -DDEBUG_ESP_MDNS
espinotee.menu.lvl.HWDT=HWDT
espinotee.menu.lvl.HWDT.build.debug_level= -DDEBUG_ESP_HWDT
espinotee.menu.lvl.HWDT_NOEXTRA4K=HWDT_NOEXTRA4K
espinotee.menu.lvl.HWDT_NOEXTRA4K.build.debug_level= -DDEBUG_ESP_HWDT_NOEXTRA4K
espinotee.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS
espinotee.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS
espinotee.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT
espinotee.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT
espinotee.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT_NOEXTRA4K
espinotee.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT_NOEXTRA4K
espinotee.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS
espinotee.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS
espinotee.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT
espinotee.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT
espinotee.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT_NOEXTRA4K
espinotee.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT_NOEXTRA4K
espinotee.menu.lvl.NoAssert-NDEBUG=NoAssert-NDEBUG
espinotee.menu.lvl.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
espinotee.menu.wipe.none=Only Sketch
espinotee.menu.wipe.none.upload.erase_cmd=
espinotee.menu.wipe.sdk=Sketch + WiFi Settings
espinotee.menu.wipe.sdk.upload.erase_cmd=erase_region "{build.rfcal_addr}" 0x4000
espinotee.menu.wipe.all=All Flash Contents
espinotee.menu.wipe.all.upload.erase_cmd=erase_flash
espinotee.menu.baud.115200=115200
espinotee.menu.baud.115200.upload.speed=115200
espinotee.menu.baud.57600=57600
espinotee.menu.baud.57600.upload.speed=57600
espinotee.menu.baud.230400.linux=230400
espinotee.menu.baud.230400.macosx=230400
espinotee.menu.baud.230400.upload.speed=230400
espinotee.menu.baud.256000.windows=256000
espinotee.menu.baud.256000.upload.speed=256000
espinotee.menu.baud.460800.linux=460800
espinotee.menu.baud.460800.macosx=460800
espinotee.menu.baud.460800.upload.speed=460800
espinotee.menu.baud.512000.windows=512000
espinotee.menu.baud.512000.upload.speed=512000
espinotee.menu.baud.921600=921600
espinotee.menu.baud.921600.upload.speed=921600
espinotee.menu.baud.3000000=3000000
espinotee.menu.baud.3000000.upload.speed=3000000
espinotee.menu.eesz.autoflash=Mapping defined by Hardware and Sketch
espinotee.menu.eesz.autoflash.build.flash_size=16M
espinotee.menu.eesz.autoflash.build.flash_ld=eagle.flash.auto.ld
espinotee.menu.eesz.autoflash.build.extra_flags=-DAUTOFLASHSIZE=1
espinotee.menu.eesz.autoflash.upload.maximum_size=1044464

